project/app/Http/Controllers/Admin/AdminController.php

select count(*) as aggregate from `campaigns`
select * from `campaigns` order by `id` desc limit 5
select * from `contact_messages` order by `id` desc limit 6
select * from `donations` order by `id` desc limit 7
select * from `users` order by `id` desc limit 6
select count(*) as aggregate from `subscribers`
select count(*) as aggregate from `donations`
select count(*) as aggregate from `users`
select count(*) as aggregate from `events`
---
    public function index()
    {
        $data['total_campaign'] = Campaign::count();
        $data['recent_campaigns'] = Campaign::orderby('id', 'desc')->take(5)->get();
        $data['recent_messages'] = ContactMessage::orderby('id', 'desc')->take(6)->get();
        $data['recent_donations'] = Donation::orderby('id', 'desc')->take(7)->get();
        $data['recent_users'] = User::orderby('id', 'desc')->take(6)->get();
        $data['total_subscribers'] = Subscriber::count();
        $data['total_projects'] = 1;
        $data['total_donations'] = Donation::count();
        $data['total_users'] = User::count();
        $data['total_events'] = Event::count();