project/app/Http/Controllers/Admin/DonationController.php

    public function index(Request $request)
    {
        $donations = Donation::with('campaign')
            ->latest()->paginate(12);
---
select * from `donations` order by `created_at` desc limit 12 offset 0
select count(*) as aggregate from `donations`