project/app/Providers/AppServiceProvider.php

select * from `generalsettings` limit 1
---
    public function register(): void
    {

        // if (!file_exists('project/storage/installed') && !request()->is('install') && !request()->is('install/*')) {
        //     header("Location: install/");
        //     exit;
        // }


        view()->composer('*', function ($settings) {
            $settings->with('gs', Generalsetting::first());
        });