project/app/Http/Helpers/helper.php

function showAdminAmount($amount)
{
    $currency = Currency::whereDefault(1)->first();
---
select * from `currencies` where `default` = 1 limit 1